// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "送给我",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "我最爱的宝宝",  // 同上...
        "今天是你的生日",
        "这是我们在一起的",
        "你的第一个生日！",
        "这三百多天来，我见过你",
        "各种各样好看的时候",
        "这是你给我发的第一张照片",
        "青春、清纯、可爱让我沉迷",
        "这是你和我说你不太行时候的照片",
        "我觉得也好看诶宝宝",
        "给我看的第一张不戴眼镜的照片",
        "到沈阳后马上就发的照片",
        "军训的时候发的照片",
        "我们快见面啦",
        "第一次在辽大户外通宵",
        "我们一起许下的第一个愿望",
        "高兴的比✌",
        "傻傻的我，和美美的你",
        "嘻嘻我买的帽子",
        "小猫第一次来武汉啦",
        "打卡黄鹤楼啦",
        "离开武汉的时候，在呜呜的",
        "好好看的宝宝",
        "第一次旅游啦，多巴胺嘟嘻嘻",
        "保安和他的女老板",
        "美丽死啦！！！！",
        "都是我喜欢的样子",
        "这是宝宝答应我表白的时候",
        "宝宝我好喜欢你",
        "喜欢每一次你对我说好多好玩的事情",
        "也喜欢你和我说无数次喜欢我",
        "我喜欢你杨雨宸，新的一岁里希望宝宝",
        "今年要吃好好的",
        "喂饱饱的",
        "然后才有力气干活",
        "和想我！",
        "生日快乐~~",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "送给我": "./imgs/songxinxin.jpeg",
        "我最爱的宝宝": "./imgs/zuiaidebb.jpg",
        "今天是你的生日": "./imgs/shengri.jpeg",
        "这是我们在一起的": "./imgs/zaiyiqi.png",
        "你的第一个生日！": "./imgs/nothing.jpg",
        "这三百多天来，我见过你": "./imgs/yangzi.jpeg",
        //"各种各样好看的时候": "./imgs/nothing.jpg",
        "这是你给我发的第一张照片": "./imgs/first.jpg",
        //"青春、清纯、可爱让我沉迷",
        "这是你和我说你不太行时候的照片": "./imgs/second.jpg",
        //"我觉得也好看诶宝宝",
        "给我看的第一张不戴眼镜的照片": "./imgs/third.jpg",
        "到沈阳后马上就发的照片": "./imgs/four.jpg",
        "军训的时候发的照片":"./imgs/five.jpg",
        "我们快见面啦":"./imgs/six.jpg",
        "第一次在辽大户外通宵":"./imgs/seven.jpg",
        "我们一起许下的第一个愿望":"./imgs/eight.jpg",
        "高兴的比✌":"./imgs/nine.jpg",
        "傻傻的我，和美美的你":"./imgs/ten.jpg",
        "嘻嘻我买的帽子":"./imgs/eleven.jpg",
        "小猫第一次来武汉啦":"./imgs/twelve.jpg",
        "打卡黄鹤楼啦":"./imgs/14.jpg",
        "离开武汉的时候，在呜呜的":"./imgs/thirteen.jpg",
        "好好看的宝宝":"./imgs/15.jpg",
        "第一次旅游啦，多巴胺嘟嘻嘻":"./imgs/16.jpg",
        "保安和他的女老板":"./imgs/17.jpg",
        "美丽死啦！！！！":"./imgs/18.jpg",
        "都是我喜欢的样子": "./imgs/love.png",
        "这是宝宝答应我表白的时候":"./imgs/19.jpg",
        "今年要吃好好的": "./imgs/chihaodian.jpeg",
        "喂饱饱的": "./imgs/weibao.jpeg",
        "然后才有力气干活": "./imgs/nothing.jpg",
        "和想我！": "./imgs/nothing.jpg",
        "生日快乐~~": "./imgs/nothing.jpg"
    },
    
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "点我开始",
        play: "上音乐",
        bannar_coming: "搞点颜色",
        balloons_flying: "好像还少点东西",
        cake_fadein: "蛋糕？",
        light_candle: "蜡烛？",
        wish_message: "生日快乐～",
        story: "A MESSAGE FOR YOU"
    },

    // 结束语
    loveText: '爱你的罗先生~'
};
